apache/nuttx/arch/arm/src/stm32/stm32_foc.c
/****************************************************************************
 * arch/arm/src/stm32/stm32_foc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdio.h>
#include <stdlib.h>
#include <strings.h>
#include <errno.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <nuttx/arch.h>
#include <nuttx/mutex.h>

#include "arm_internal.h"
#include "stm32_pwm.h"
#include "stm32_adc.h"
#include "stm32_dma.h"

#include <arch/irq.h>
#include <arch/chip/chip.h>

#include "stm32_foc.h"

#include "hardware/stm32_dbgmcu.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Verify peripheral configuration ******************************************/

/* This is the lower-half implementation for the STM32 FOC devices.
 *
 * We currently support a current sensing topology with two and three shunts.
 * Configuration with a single-shunt is not supported at the moment and will
 * require additional current reconstruction logic.
 *
 * A single FOC device uses one advanced timer to generate a center-aligned
 * PWM which control phase switches bridge. Phase currents must be sampled
 * at vector 0 (all low-side switches are on and the current flows through
 * current sensors).
 *
 * This implementation uses one ADC per controller and we only use injected
 * conversion to sample currents. ADC regular conversion is not used
 * and can be used to other tasks with the help of DMA transfer.
 * For ADC regular conversion, only DMA transfer is possible since ADC
 * interrupt handler is reserved for the FOC only.
 *
 * The ADC conversion trigger is configurable. Available options are:
 *   1. TRGO events generated on update event
 *   2. CCR4 events
 *
 * There are some differences in implementation depending on the peripherals
 * supported by the chip.
 *
 * There is no differences according to TIMER IPv1 and IPv2 affecting
 * this implementation.
 *
 * For STM32 ADC cores there are some dissimilarities that had to be taken
 * into account. It is:
 *
 *   1. For ADC IPv1 (F2, F4, F7, L1)
 *     - all ADC instances coupled in single block
 *     - single entry point for ADC123 interrupts
 *
 *   2. For ADC IPv1 basic (F1, F37x)
 *     - ADC instances are no coupled in blocks
 *     - common interrupts for ADC1 and ADC2
 *
 *   3. For ADC IPv2 (F3 (without F37x), H7, L4, L4+, G4)
 *     - ADC grouped in slave-master configuration (ADC12, ADC34)
 *
 * This code will not work for chips with ADC IPv2 basic (F0, L0, G0).
 * For these, only regular channels are available and we cannot use injected
 * conversion.
 *
 * Currently, up to two FOC instances are supported.
 */

/* Verify system configuration **********************************************/

/* This is not for ADC IPv2 basic */

#if defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V2) && defined(HAVE_BASIC_ADC)
#  error Not supported ADC IP core
#endif

/* Multi instances support tested only on IP_ADC_V1 */

#if CONFIG_MOTOR_FOC_INST > 1
#  if defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V2)
#    error Not tested yet
#  endif
#endif

/* PWM lower-half ops and ADC lower-half ops must be enabled */

#ifndef CONFIG_STM32_PWM_LL_OPS
#  error PWM low-level operations interface must be enabled
#endif
#ifndef CONFIG_STM32_ADC_LL_OPS
#  error ADC low-level operations interface must be enabled
#endif

/* We don't want start conversion during ADC setup */

#ifndef CONFIG_STM32_ADC_NO_STARTUP_CONV
#  error ADC startup conversion must be disabled
#endif

/* We need interface to change ADC sample-time */

#ifndef CONFIG_STM32_ADC_CHANGE_SAMPLETIME
#  error ADC sample-time configuration interface must be enabled
#endif

/* Debug register for PWM timers */

#if defined(CONFIG_STM32_HAVE_IP_DBGMCU_M3M4_V2) || \
    defined(CONFIG_STM32_HAVE_IP_DBGMCU_M3M4_V3)
#  define FOC_PWM_FZ_REG    (STM32_DBGMCU_APB2_FZ)
#elif defined(CONFIG_STM32_HAVE_IP_DBGMCU_M3M4_V1)
#  define FOC_PWM_FZ_REG    (STM32_DBGMCU_CR)
#endif

/* FOC0 always use TIMER1 for PWM */

#ifdef CONFIG_STM32_FOC_FOC0
#  define FOC0_PWM           (1)
#  define FOC0_PWM_NCHANNELS (PWM_TIM1_NCHANNELS)
#  define FOC0_PWM_BASE      (STM32_TIM1_BASE)
#  if defined(CONFIG_STM32_HAVE_IP_DBGMCU_M3M4_V2) ||  \
      defined(CONFIG_STM32_HAVE_IP_DBGMCU_M3M4_V3)
#    define FOC0_PWM_FZ_BIT    (DBGMCU_APB2_TIM1STOP)
#  elif defined(CONFIG_STM32_HAVE_IP_DBGMCU_M3M4_V1)
#    define FOC0_PWM_FZ_BIT    (DBGMCU_CR_TIM1STOP)
#  endif
#  if CONFIG_STM32_TIM1_MODE != 2
#    error TIM1 must be configured in center-aligned mode 1
#  endif
#endif /* CONFIG_STM32_FOC_FOC0 */

/* FOC1 always use TIMER8 for PWM */

#ifdef CONFIG_STM32_FOC_FOC1
#  define FOC1_PWM           (8)
#  define FOC1_PWM_NCHANNELS (PWM_TIM8_NCHANNELS)
#  define FOC1_PWM_BASE      (STM32_TIM8_BASE)
#  if defined(CONFIG_STM32_HAVE_IP_DBGMCU_M3M4_V2) ||  \
      defined(CONFIG_STM32_HAVE_IP_DBGMCU_M3M4_V3)
#    define FOC1_PWM_FZ_BIT    (DBGMCU_APB2_TIM8STOP)
#  elif defined(CONFIG_STM32_HAVE_IP_DBGMCU_M3M4_V1)
#    define FOC1_PWM_FZ_BIT    (DBGMCU_CR_TIM8STOP)
#  endif
#  if CONFIG_STM32_TIM8_MODE != 2
#    error TIM8 must be configured in center-aligned mode 1
#  endif
#endif

/* The maximum supported number of phases depends on the ADC trigger */

#if defined(CONFIG_STM32_FOC_ADC_CCR4)
#  if CONFIG_MOTOR_FOC_PHASES > 3
#    error max 3 phases supported
#  endif
#elif defined(CONFIG_STM32_FOC_ADC_TRGO)
#  if CONFIG_MOTOR_FOC_PHASES > 4
#    error max 4 phases supported
#  endif
#else
#  error
#endif

/* Tested only for 3-phase devices */

