apache/nuttx/arch/arm/src/stm32/stm32_foc.c
#if CONFIG_MOTOR_FOC_PHASES != 3
#  error Tested only for 3-phase devices
#endif

/* Only one ADC trigger must be selected */

#if defined(CONFIG_STM32_FOC_ADC_CCR4) && defined(CONFIG_STM32_FOC_ADC_TRGO)
#  error Invalid ADC trigger configuration
#endif

/* Phase currents can only be sampled when all low-side switches are off.
 * This is only valid for the V0 vector in the SVM.
 *
 * For PWM mode 1:
 *   V7 for CNTR = 0
 *   V0 for CNTR = ARR
 *
 * For PWM mode 2:
 *   V7 for CNTR = ARR
 *   V0 for CNTR = 0
 */

#if defined(CONFIG_STM32_FOC_ADC_CCR4)

/* FOC ADC trigger on CCR4 **************************************************/

/* PWM channels configuration:
 *   - 3 channels for phases PWM (CCR1, CCR2, CCR3)
 *   - 1 channel for ADC injection sequence trigger (CCR4)
 */

#  if defined(CONFIG_STM32_FOC_FOC0)
#    if FOC0_PWM_NCHANNELS != (CONFIG_MOTOR_FOC_PHASES + 1)
#      error Invalid channels configuration
#    endif
#  endif
#  if defined(CONFIG_STM32_FOC_FOC1)
#    if FOC1_PWM_NCHANNELS != (CONFIG_MOTOR_FOC_PHASES + 1)
#      error Invalid channels configuration
#    endif
#  endif

/* Generalize JEXTSEL bits for CCR4 trigger.
 *
 * ADC trigger event on PWM timer CCR4 (rising edge).
 *
 * This implementation uses PWM mode 1 so:
 *   TIMx CCR4 = (ARR - trigger_offset)
 */

#  if defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V2)
#    ifdef CONFIG_STM32_FOC_USE_TIM1
#      define ADC_JEXTSEL_T1CC4 (ADC12_JSQR_JEXTSEL_T1CC4)
#    endif
#    ifdef CONFIG_STM32_FOC_USE_TIM8
#      define ADC_JEXTSEL_T8CC4 (ADC12_JSQR_JEXTSEL_T8CC4)
#    endif
#  elif defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V1)
#    ifdef CONFIG_STM32_FOC_USE_TIM1
#      define ADC_JEXTSEL_T1CC4  (ADC_CR2_JEXTSEL_T1CC4)
#    endif
#    ifdef CONFIG_STM32_FOC_USE_TIM8
#      define ADC_JEXTSEL_T8CC4  (ADC_CR2_JEXTSEL_T8CC4)
#    endif
#  else
#    error Not supported
#  endif

/* ADC trigger offset - must be greater than 0! */

#  define ADC_TRIGGER_OFFSET (1)

#  ifdef CONFIG_STM32_FOC_FOC0
#    define FOC0_ADC_JEXTSEL  (ADC_JEXTSEL_T1CC4)
#  endif
#  ifdef CONFIG_STM32_FOC_FOC1
#    define FOC1_ADC_JEXTSEL  (ADC_JEXTSEL_T8CC4)
#  endif

#elif defined(CONFIG_STM32_FOC_ADC_TRGO)

/* FOC ADC trigger on TRGO **************************************************/

/* PWM TRGO support must be enabled */

#  ifndef CONFIG_STM32_PWM_TRGO
#    error PWM TRGO support must be enabled
#  endif

/* TRGO on update event = ATIM_CR2_MMS_UPDATE (2) */

#  define FOC_PWM_TRGO (2)

/* PWM channels configuration:
 *   - n channels for phases PWM (CCR1, CCR2, CCR3, CCR4)
 */

#  if defined(CONFIG_STM32_FOC_FOC0)
#    if FOC0_PWM_NCHANNELS != (CONFIG_MOTOR_FOC_PHASES)
#      error Invalid channels configuration
#    endif
#  endif
#  if defined(CONFIG_STM32_FOC_FOC1)
#    if FOC1_PWM_NCHANNELS != (CONFIG_MOTOR_FOC_PHASES)
#      error Invalid channels configuration
#    endif
#  endif

/* Generalize JEXTSEL bits for TRGO trigger.
 *
 * ADC trigger event on PWM timer TRGO (rising edge).
 *
 * This implementation uses PWM mode 1 so:
 *   TIMx TRGO = (ARR)
 */

#  if defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V2)
#    ifdef CONFIG_STM32_FOC_USE_TIM1
#      define ADC_JEXTSEL_T1TRGO (ADC12_JSQR_JEXTSEL_T1TRGO)
#    endif
#    ifdef CONFIG_STM32_FOC_USE_TIM8
#      define ADC_JEXTSEL_T8TRGO (ADC12_JSQR_JEXTSEL_T8TRGO)
#    endif
#  elif defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V1)
#    ifdef CONFIG_STM32_FOC_USE_TIM1
#      define ADC_JEXTSEL_T1TRGO  (ADC_CR2_JEXTSEL_T1TRGO)
#    endif
#    ifdef CONFIG_STM32_FOC_USE_TIM8
#      error TIM8 and TRGO trigger not supported for ADC IPv1
#    endif
#  else
#    error Not supported
#  endif

#  ifdef CONFIG_STM32_FOC_FOC0
#    define FOC0_ADC_JEXTSEL  (ADC_JEXTSEL_T1TRGO)
#  endif
#  ifdef CONFIG_STM32_FOC_FOC1
#    define FOC1_ADC_JEXTSEL  (ADC_JEXTSEL_T8TRGO)
#  endif

#else

/* No trigger selected ******************************************************/

#  error Invalid FOC ADC trigger
#endif

/* Phase current samples for FOC0 */

#ifdef CONFIG_STM32_FOC_FOC0
#  ifdef CONFIG_STM32_FOC_FOC0_ADC1
#    define FOC0_ADC 1
#  endif
#  ifdef CONFIG_STM32_FOC_FOC0_ADC2
#    define FOC0_ADC 2
#  endif
#  ifdef CONFIG_STM32_FOC_FOC0_ADC3
#    define FOC0_ADC 3
#  endif
#  ifdef CONFIG_STM32_FOC_FOC0_ADC4
#    define FOC0_ADC 4
#  endif
#endif

/* Phase current samples for FOC1 */

#ifdef CONFIG_STM32_FOC_FOC1
#  ifdef CONFIG_STM32_FOC_FOC1_ADC1
#    define FOC1_ADC 1
#  endif
#  ifdef CONFIG_STM32_FOC_FOC1_ADC2
#    define FOC1_ADC 2
#  endif
#  ifdef CONFIG_STM32_FOC_FOC1_ADC3
#    define FOC1_ADC 3
#  endif
#  ifdef CONFIG_STM32_FOC_FOC1_ADC4
#    define FOC1_ADC 4
#  endif
#endif

/* The number of required injected channels */

#ifdef CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND
#  define FOC_ADC_INJ_CHAN_REQUIRED (CONFIG_MOTOR_FOC_SHUNTS + 1)
#else
#  define FOC_ADC_INJ_CHAN_REQUIRED (CONFIG_MOTOR_FOC_SHUNTS)
#endif

/* Validate ADC configuration:
 *   1. ADC must be supported by chip,
 *   2. ADC support for injected channels must be enabled,
 *   3. ADC software trigger starts only regular conversion.
 */

#ifdef CONFIG_STM32_FOC_USE_ADC1
#  ifndef CONFIG_STM32_ADC1
#    error ADC1 not supported !
#  endif
#  ifndef ADC1_HAVE_JEXTCFG
#    error ADC1 must support JEXTCFG
#  endif
#  if CONFIG_STM32_ADC1_ANIOC_TRIGGER != 1
#    error CONFIG_STM32_ADC1_ANIOC_TRIGGER must be 1
#  endif
#  if CONFIG_STM32_ADC1_INJECTED_CHAN != FOC_ADC_INJ_CHAN_REQUIRED
#    error Invalid configuration for ADC1 injected channels
#  endif
#endif
#ifdef CONFIG_STM32_FOC_USE_ADC2
#  ifndef CONFIG_STM32_ADC2
#    error ADC2 not supported !
#  endif
#  ifndef ADC2_HAVE_JEXTCFG
#    error ADC2 must support JEXTCFG
#  endif
#  if CONFIG_STM32_ADC2_ANIOC_TRIGGER != 1
#    error CONFIG_STM32_ADC2_ANIOC_TRIGGER must be 1
#  endif
#  if CONFIG_STM32_ADC2_INJECTED_CHAN != FOC_ADC_INJ_CHAN_REQUIRED
#    error Invalid configuration for ADC2 injected channels
#  endif
#endif
#ifdef CONFIG_STM32_FOC_USE_ADC3
#  ifndef CONFIG_STM32_ADC3
#    error ADC3 not supported !
#  endif
#  ifndef ADC3_HAVE_JEXTCFG
#    error ADC3 must support JEXTCFG
#  endif
#  if CONFIG_STM32_ADC3_ANIOC_TRIGGER != 1
#    error CONFIG_STM32_ADC3_ANIOC_TRIGGER must be 1
#  endif
#  if CONFIG_STM32_ADC3_INJECTED_CHAN != FOC_ADC_INJ_CHAN_REQUIRED
#    error Invalid configuration for ADC3 injected channels
#  endif
#endif
#ifdef CONFIG_STM32_FOC_USE_ADC4
#  ifndef CONFIG_STM32_ADC4
#    error ADC4 not supported !
#  endif
#  ifndef ADC4_HAVE_JEXTCFG
#    error ADC4 must support JEXTCFG
#  endif
#  if CONFIG_STM32_ADC4_ANIOC_TRIGGER != 1
#    error CONFIG_STM32_ADC4_ANIOC_TRIGGER must be 1
#  endif
#  if CONFIG_STM32_ADC4_INJECTED_CHAN != FOC_ADC_INJ_CHAN_REQUIRED
#    error Invalid configuration for ADC4 injected channels
#  endif
#endif

/* Max 3 shunts supported if STM32G4 ADC CHAN0 workaround enabled */

#ifdef CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND
#  if CONFIG_MOTOR_FOC_SHUNTS > 3
#    error
#  endif
#endif

/* Combine JEXTSEL with JEXTEN default */

#ifdef CONFIG_STM32_FOC_FOC0
#  define FOC0_ADC_JEXT (ADC_JEXTREG_JEXTEN_DEFAULT | FOC0_ADC_JEXTSEL)
#endif
#ifdef CONFIG_STM32_FOC_FOC1
#  define FOC1_ADC_JEXT (ADC_JEXTREG_JEXTEN_DEFAULT | FOC1_ADC_JEXTSEL)
#endif

/* Generalize ADC interrupt flags */

