apache/nuttx/arch/arm/src/stm32/stm32_foc.c
#if defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V2)
#  define FOC_ADC_ISR_FOC ADC_ISR_JEOS
#  define FOC_ADC_IER_FOC ADC_IER_JEOS
#  define FOC_ADC_ISR_OVR ADC_INT_OVR
#elif defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V1)
#  define FOC_ADC_ISR_FOC ADC_ISR_JEOC
#  define FOC_ADC_IER_FOC ADC_IER_JEOC
#  define FOC_ADC_ISR_OVR ADC_SR_OVR
#else
#  error Not supported
#endif

/* We have 3 possible ADC IRQ configuration */

#if defined(STM32_IRQ_ADC1)

/* Only ADC1 supported */

#  define STM32_IRQ_ADC1_FOC  STM32_IRQ_ADC1

#elif defined(STM32_IRQ_ADC12)

/* ADC1 + ADC2 interrupt */

#  define STM32_IRQ_ADC1_FOC  STM32_IRQ_ADC12
#  define STM32_IRQ_ADC2_FOC  STM32_IRQ_ADC12

/* ADC3 + ADC4 interrupt */

#  define STM32_IRQ_ADC3_FOC  STM32_IRQ_ADC34
#  define STM32_IRQ_ADC4_FOC  STM32_IRQ_ADC34

#elif defined(STM32_IRQ_ADC)

/* ADC1 + ADC2 + ADC3 interrupt */

#  define STM32_IRQ_ADC1_FOC  STM32_IRQ_ADC
#  define STM32_IRQ_ADC2_FOC  STM32_IRQ_ADC
#  define STM32_IRQ_ADC3_FOC  STM32_IRQ_ADC
#endif

/* ADC common ***************************************************************/

/* Common for ADCv1 */

#if defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V1) && !defined(HAVE_BASIC_ADC)
#  define FOC_ADC_HAVE_CMN (1)
#  ifdef CONFIG_STM32_FOC_USE_ADC1
#    define FOC_ADC1_CMN (&g_stm32_foc_adccmn123)
#  endif
#  ifdef CONFIG_STM32_FOC_USE_ADC2
#    define FOC_ADC2_CMN (&g_stm32_foc_adccmn123)
#  endif
#  ifdef CONFIG_STM32_FOC_USE_ADC3
#    define FOC_ADC3_CMN (&g_stm32_foc_adccmn123)
#  endif
#endif

/* Common for ADCv1 basic */

#if defined(CONFIG_STM32_HAVE_IP_ADC_M3M4_V1) && defined(HAVE_BASIC_ADC)
#  undef FOC_ADC_HAVE_CMN
#  ifdef CONFIG_STM32_FOC_USE_ADC1
#    define FOC_ADC1_CMN (0)
#  endif
#  ifdef CONFIG_STM32_FOC_USE_ADC2
#    define FOC_ADC2_CMN (0)
#  endif
#  ifdef CONFIG_STM32_FOC_USE_ADC3
#    define FOC_ADC3_CMN (0)
#  endif
#endif

/* Common for ADCv2 */

#ifdef CONFIG_STM32_HAVE_IP_ADC_M3M4_V2
#  define FOC_ADC_HAVE_CMN (1)
#  ifdef CONFIG_STM32_FOC_USE_ADC1
#    define FOC_ADC1_CMN (&g_stm32_foc_adccmn12)
#  endif
#  ifdef CONFIG_STM32_FOC_USE_ADC2
#    define FOC_ADC2_CMN (&g_stm32_foc_adccmn12)
#  endif
#  ifdef CONFIG_STM32_FOC_USE_ADC3
#    define FOC_ADC3_CMN (&g_stm32_foc_adccmn34)
#  endif
#  ifdef CONFIG_STM32_FOC_USE_ADC4
#    define FOC_ADC4_CMN (&g_stm32_foc_adccmn34)
#  endif
#endif

/* FOC ADC configuration ****************************************************/

#ifdef CONFIG_STM32_FOC_FOC0
#  ifdef CONFIG_STM32_FOC_FOC0_ADC1
#    define FOC0_ADC_IRQ STM32_IRQ_ADC1_FOC
#    define FOC0_ADC_CMN FOC_ADC1_CMN
#  endif
#  ifdef CONFIG_STM32_FOC_FOC0_ADC2
#    define FOC0_ADC_IRQ STM32_IRQ_ADC2_FOC
#    define FOC0_ADC_CMN FOC_ADC2_CMN
#  endif
#  ifdef CONFIG_STM32_FOC_FOC0_ADC3
#    define FOC0_ADC_IRQ STM32_IRQ_ADC3_FOC
#    define FOC0_ADC_CMN FOC_ADC3_CMN
#  endif
#  ifdef CONFIG_STM32_FOC_FOC0_ADC4
#    define FOC0_ADC_IRQ STM32_IRQ_ADC4_FOC
#    define FOC0_ADC_CMN FOC_ADC4_CMN
#  endif
#endif

#ifdef CONFIG_STM32_FOC_FOC1
#  ifdef CONFIG_STM32_FOC_FOC1_ADC1
#    define FOC1_ADC_IRQ STM32_IRQ_ADC1_FOC
#    define FOC1_ADC_CMN FOC_ADC1_CMN
#  endif
#  ifdef CONFIG_STM32_FOC_FOC1_ADC2
#    define FOC1_ADC_IRQ STM32_IRQ_ADC2_FOC
#    define FOC1_ADC_CMN FOC_ADC2_CMN
#  endif
#  ifdef CONFIG_STM32_FOC_FOC1_ADC3
#    define FOC1_ADC_IRQ STM32_IRQ_ADC3_FOC
#    define FOC1_ADC_CMN FOC_ADC3_CMN
#  endif
#  ifdef CONFIG_STM32_FOC_FOC1_ADC4
#    define FOC1_ADC_IRQ STM32_IRQ_ADC4_FOC
#    define FOC1_ADC_CMN FOC_ADC4_CMN
#  endif
#endif

#ifdef CONFIG_MOTOR_FOC_BEMF_SENSE

/* Additional checks for BEMF sensing */

#  if defined(CONFIG_STM32_FOC_FOC0) && defined(CONFIG_STM32_FOC_FOC1)
#    error BEMF sensing supported only for one FOC instance enabled
#  endif

#  if defined(CONFIG_STM32_FOC_FOC0_ADC2) || defined(CONFIG_STM32_FOC_FOC0_ADC3)
#    error FOC must use ADC master
#  endif
#  if defined(CONFIG_STM32_FOC_FOC1_ADC2) || defined(CONFIG_STM32_FOC_FOC1_ADC3)
#    error FOC must use ADC master
#  endif

/* Additional ADC slave in use */

#  if defined(CONFIG_STM32_FOC_FOC0_ADC1) || defined(CONFIG_STM32_FOC_FOC1_ADC1)
#    define CONFIG_STM32_FOC_USE_ADC2
#  endif
#  if defined(CONFIG_STM32_FOC_FOC0_ADC3) || defined(CONFIG_STM32_FOC_FOC1_ADC3)
#    define CONFIG_STM32_FOC_USE_ADC4
#  endif

/* The number of required injected channels */

#  ifdef CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND
#    define FOC_VADC_INJ_CHAN_REQUIRED (CONFIG_MOTOR_FOC_PHASES + 1)
#  else
#    define FOC_VADC_INJ_CHAN_REQUIRED (CONFIG_MOTOR_FOC_PHASES)
#  endif

/* Slave ADC2 */

#  ifdef CONFIG_STM32_FOC_USE_ADC2
#    ifndef CONFIG_STM32_ADC2
#      error ADC2 not supported !
#    endif
#    ifndef ADC2_HAVE_JEXTCFG
#      error ADC2 must support JEXTCFG
#    endif
#    if CONFIG_STM32_ADC2_ANIOC_TRIGGER != 1
#      error CONFIG_STM32_ADC2_ANIOC_TRIGGER must be 1
#    endif
#    if CONFIG_STM32_ADC2_INJECTED_CHAN != FOC_VADC_INJ_CHAN_REQUIRED
#      error Invalid configuration for ADC2 injected channels
#    endif
#  endif

/* Slave ADC4 */

#  ifdef CONFIG_STM32_FOC_USE_ADC4
#    ifndef CONFIG_STM32_ADC4
#      error ADC4 not supported !
#    endif
#    ifndef ADC4_HAVE_JEXTCFG
#      error ADC4 must support JEXTCFG
#    endif
#    if CONFIG_STM32_ADC4_ANIOC_TRIGGER != 1
#      error CONFIG_STM32_ADC4_ANIOC_TRIGGER must be 1
#    endif
#    if CONFIG_STM32_ADC4_INJECTED_CHAN != FOC_VADC_INJ_CHAN_REQUIRED
#      error Invalid configuration for ADC4 injected channels
#    endif
#  endif

#endif

/* Helper macros ************************************************************/

/* Get arch-specific FOC private part */

#define STM32_FOCPIRV_FROM_DEV_GET(d)              \
  ((struct stm32_foc_priv_s *)(d)->lower->data)

/* Get board-specific FOC data */

#define STM32_FOCBOARD_FROM_DEV_GET(d)         \
  ((STM32_FOCPIRV_FROM_DEV_GET(d))->board)

/* Get arch-specific FOC devices */

#define STM32_FOCDEV_FROM_DEV_GET(d)           \
  ((STM32_FOCPIRV_FROM_DEV_GET(d))->dev)

/* Get PWM device */

#define PWM_FROM_FOC_DEV_GET(d) (STM32_FOCDEV_FROM_DEV_GET(d)->pwm)

