apache/nuttx/arch/arm/src/stm32/stm32_foc.c
  /* Reset ADC interrupts counter */

  priv->data.adcint_cntr = 0;

  /* Start ADC and PWM */

  stm32_foc_adc_start(dev, true);
  stm32_foc_pwm_start(dev, true);

  /* Wait for calibration done semaphore
   * All work is done in adc_calibration_handler
   */

  ret = nxsem_wait_uninterruptible(&priv->cal_done_sem);
  if (ret < 0)
    {
      goto errout;
    }

  /* Stop ADC and PWM */

  stm32_foc_pwm_start(dev, false);
  stm32_foc_adc_start(dev, false);

  /* Reset ADC interrupt handler */

  foc_dev->adc_isr = NULL;

  /* Clear last ADC data */

  for (i = 0; i < CONFIG_MOTOR_FOC_SHUNTS; i += 1)
    {
      priv->data.curr_raw[i] = 0;
    }

  /* Set ADC hardware offset for current channels (only injected channels) */

  for (i = 0; i < CONFIG_MOTOR_FOC_SHUNTS; i += 1)
    {
      /* Get channel */

      ch = board->data->adc_cfg->chan[board->data->adc_cfg->regch + i];

      /* Write offset */

      STM32_ADC_OFFSET_SET(adc, ch, i, priv->data.curr_offset[i]);
    }

#ifdef CONFIG_MOTOR_FOC_BEMF_SENSE

  /* TODO: BEMF sensing calibartion */

  for (i = 0; i < CONFIG_MOTOR_FOC_PHASES; i += 1)
    {
      priv->data.volt_offset[i] = 0;
    }

  /* Clear last ADC data */

  for (i = 0; i < CONFIG_MOTOR_FOC_PHASES; i += 1)
    {
      priv->data.volt_raw[i] = 0;
    }

  /* Set ADC hardware offset for voltage channels (only injected channels) */

  for (i = 0; i < CONFIG_MOTOR_FOC_PHASES; i += 1)
    {
      /* Get channel */

      ch = board->data->vadc_cfg->chan[board->data->vadc_cfg->regch + i];

      /* Write offset */

      STM32_ADC_OFFSET_SET(vadc, ch, i, priv->data.volt_offset[i]);
    }
#endif

  mtrinfo("ADC offset calibration - DONE!\n");

errout:

  /* Call board-specific */

  board->ops->calibration(dev, false);

  /* Reset ADC interrupts counter */

  priv->data.adcint_cntr = 0;

  return ret;
}

/****************************************************************************
 * Name: stm32_foc_pwm_duty_set
 *
 * Description:
 *   Set the 3-phase PWM duty cycle
 *
 ****************************************************************************/

static int stm32_foc_pwm_duty_set(struct foc_dev_s *dev,
                                  foc_duty_t *duty)
{
  struct stm32_foc_priv_s *priv    = STM32_FOCPIRV_FROM_DEV_GET(dev);
  struct stm32_foc_dev_s  *foc_dev = STM32_FOCDEV_FROM_DEV_GET(dev);
  uint16_t                 ccr[CONFIG_MOTOR_FOC_PHASES];

  DEBUGASSERT(dev);
  DEBUGASSERT(duty);
  DEBUGASSERT(priv);
  DEBUGASSERT(foc_dev);
  DEBUGASSERT(priv->data.per != 0);

  /* Get the CCR for a given duty cycle */

  DEBUGASSERT(duty[0] >= 0);
  DEBUGASSERT(duty[1] >= 0);
#if CONFIG_MOTOR_FOC_PHASES > 2
  DEBUGASSERT(duty[2] >= 0);
#endif
#if CONFIG_MOTOR_FOC_PHASES > 3
  DEBUGASSERT(duty[3] >= 0);
#endif

  ccr[0] = (uint16_t)b16toi(b16muli(duty[0], priv->data.per));
  ccr[1] = (uint16_t)b16toi(b16muli(duty[1], priv->data.per));
#if CONFIG_MOTOR_FOC_PHASES > 2
  ccr[2] = (uint16_t)b16toi(b16muli(duty[2], priv->data.per));
#endif
#if CONFIG_MOTOR_FOC_PHASES > 3
  ccr[3] = (uint16_t)b16toi(b16muli(duty[3], priv->data.per));
#endif

  /* Write directly to timer registers.
   * We are not using the PWM_CCR_UPDATE interface as it is too slow
   */

  putreg32(ccr[0], (foc_dev->pwm_base + STM32_GTIM_CCR1_OFFSET));
  putreg32(ccr[1], (foc_dev->pwm_base + STM32_GTIM_CCR2_OFFSET));
#if CONFIG_MOTOR_FOC_PHASES > 2
  putreg32(ccr[2], (foc_dev->pwm_base + STM32_GTIM_CCR3_OFFSET));
#endif
#if CONFIG_MOTOR_FOC_PHASES > 3
  putreg32(ccr[3], (foc_dev->pwm_base + STM32_GTIM_CCR4_OFFSET));
#endif

  return OK;
}

/****************************************************************************
 * Name: stm32_foc_pwm_off
 *
 * Description:
 *   Set the 3-phase bridge switches in off state.
 *
 ****************************************************************************/

static int stm32_foc_pwm_off(struct foc_dev_s *dev, bool off)
{
  struct stm32_pwm_dev_s *pwm = PWM_FROM_FOC_DEV_GET(dev);

  if (off)
    {
      /* Force all transistors to low state */

      PWM_MODE_UPDATE(pwm, STM32_PWM_CHAN1, PWM_MODE_HSHI_LSLO);
      PWM_MODE_UPDATE(pwm, STM32_PWM_CHAN2, PWM_MODE_HSHI_LSLO);
#if CONFIG_MOTOR_FOC_PHASES > 2
      PWM_MODE_UPDATE(pwm, STM32_PWM_CHAN3, PWM_MODE_HSHI_LSLO);
#endif
#if CONFIG_MOTOR_FOC_PHASES > 3
      PWM_MODE_UPDATE(pwm, STM32_PWM_CHAN4, PWM_MODE_HSHI_LSLO);
#endif

      /* Disable complementary outputs */

      PWM_OUTPUTS_ENABLE(pwm, PMW_OUTPUTS_ALL_COMP, false);
    }
  else
    {
      /* Restore FOC operation modes */

      PWM_ALL_OUTPUTS_ENABLE(pwm, true);

      PWM_MODE_UPDATE(pwm, STM32_PWM_CHAN1, PWM_MODE_FOC);
      PWM_MODE_UPDATE(pwm, STM32_PWM_CHAN2, PWM_MODE_FOC);
#if CONFIG_MOTOR_FOC_PHASES > 2
      PWM_MODE_UPDATE(pwm, STM32_PWM_CHAN3, PWM_MODE_FOC);
#endif
#if CONFIG_MOTOR_FOC_PHASES > 3
      PWM_MODE_UPDATE(pwm, STM32_PWM_CHAN4, PWM_MODE_FOC);
#endif
    }

  return OK;
}

/****************************************************************************
 * Name: stm32_foc_info_get
 *
 * Description:
 *   Get HW configuration for FOC device
 *
 ****************************************************************************/

static int stm32_foc_info_get(struct foc_dev_s *dev, struct foc_info_s *info)
{
  struct stm32_foc_board_s *board = STM32_FOCBOARD_FROM_DEV_GET(dev);

  DEBUGASSERT(dev);
  DEBUGASSERT(board);

  /* Get data from board configuration */

  return board->ops->info_get(dev, info);
}

/****************************************************************************
 * Name: stm32_foc_curr_get
 *
 * Description:
 *   Get current samples from ADC
 *
 ****************************************************************************/

static void stm32_foc_curr_get(struct foc_dev_s *dev,
                               int16_t *curr, int shunts)
{
  struct stm32_foc_priv_s *priv = STM32_FOCPIRV_FROM_DEV_GET(dev);
  struct stm32_adc_dev_s  *adc  = ADC_FROM_FOC_DEV_GET(dev);
  int                      i    = 0;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv);
  DEBUGASSERT(adc);
  DEBUGASSERT(curr);

  for (i = 0; i < shunts; i += 1)
    {
      /* Get raw current samples.
       * We have ADC offset enabled for injected channels so this
       * gives us signed values.
       * NOTE: ADC value is 11 bits + sign.
       */

#ifdef CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND
      /* Ignore first channel */

      curr[i] = (int16_t)STM32_ADC_INJDATA_GET(adc, (i + 1));
#else
      curr[i] = (int16_t)STM32_ADC_INJDATA_GET(adc, i);
#endif
    }
}

#ifdef CONFIG_MOTOR_FOC_BEMF_SENSE
/****************************************************************************
 * Name: stm32_foc_volt_get
 *
 * Description:
 *   Get voltage samples from ADC
 *
 ****************************************************************************/

static void stm32_foc_volt_get(struct foc_dev_s *dev, int16_t *volt)
{
  struct stm32_foc_priv_s *priv = STM32_FOCPIRV_FROM_DEV_GET(dev);
  struct stm32_adc_dev_s  *vadc  = VADC_FROM_FOC_DEV_GET(dev);
  int                      i    = 0;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv);
  DEBUGASSERT(vadc);
  DEBUGASSERT(volt);

  /* Make sure the conversion is complete.
   * It is possible that the ADC master sequence will end in front of
   * the slave sequence. In that case we just busy-wait.
   * In the worst case scenario the slave conversion is one channel behind
   * the master conversion (2 current channels vs 3 voltage channels).
   *
   * Another solution is to make sure that both conversions has the same
   * length, but this makes the code much more complex.
   */

  while ((FOC_ADC_ISR_FOC & STM32_ADC_INT_GET(vadc)) == 0);

  /* Clear status */

  STM32_ADC_INT_ACK(vadc, FOC_ADC_ISR_FOC);

