apache/nuttx/arch/arm/src/stm32/stm32_foc.c
  for (i = 0; i < CONFIG_MOTOR_FOC_PHASES; i += 1)
    {
      /* Get raw voltage samples.
       * We have ADC offset enabled for injected channels so this
       * gives us signed values.
       * NOTE: ADC value is 11 bits + sign.
       */

#ifdef CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND
      /* Ignore first channel */

      volt[i] = (int16_t)STM32_ADC_INJDATA_GET(vadc, (i + 1));
#else
      volt[i] = (int16_t)STM32_ADC_INJDATA_GET(vadc, i);
#endif
    }
}
#endif

/****************************************************************************
 * Name: stm32_foc_notifier_cfg
 *
 * Description:
 *   Configure FOC notifier
 *
 ****************************************************************************/

static int stm32_foc_notifier_cfg(struct foc_dev_s *dev, uint32_t freq)
{
  struct stm32_foc_priv_s *priv = STM32_FOCPIRV_FROM_DEV_GET(dev);
  int                      ret  = OK;

  DEBUGASSERT(dev);
  DEBUGASSERT(priv);
  DEBUGASSERT(freq > 0);
  DEBUGASSERT(dev->cfg.pwm_freq > 0);

  /* Validate input:
   *   1. must be fraction of PWM frequency
   */

  if (dev->cfg.pwm_freq % freq != 0)
    {
      ret = -EINVAL;
      goto errout;
    }

#if defined(CONFIG_STM32_FOC_ADC_CCR4)
  /* ADC interrupts frequency is PWM frequency */

  priv->data.adc_freq = dev->cfg.pwm_freq;

  /* Get worker divider */

  priv->data.notifier_div = (dev->cfg.pwm_freq / freq);

#elif defined(CONFIG_STM32_FOC_ADC_TRGO)
  /* Call work on every ADC interrupt */

  priv->data.notifier_div = 1;

  /* ADC interrupts frequency is notifier frequency */

  priv->data.adc_freq = freq;
#else
#  error Invalid FOC ADC trigger
#endif

errout:
  return ret;
}

/****************************************************************************
 * Name: stm32_foc_bind
 *
 * Description:
 *   Bind lower-half FOC device with upper-half FOC logic
 *
 ****************************************************************************/

static int stm32_foc_bind(struct foc_dev_s *dev,
                          struct foc_callbacks_s *cb)
{
  struct stm32_foc_priv_s *priv = STM32_FOCPIRV_FROM_DEV_GET(dev);
  int                      ret  = OK;

  DEBUGASSERT(dev);
  DEBUGASSERT(cb);
  DEBUGASSERT(priv);

  /* Validate callbacks */

  DEBUGASSERT(cb->notifier);

  /* Bind upper-half FOC device callbacks */

  priv->cb = cb;
  return ret;
}

/****************************************************************************
 * Name: stm32_foc_fault_clear
 *
 * Description:
 *   Arch-specific fault clear
 *
 ****************************************************************************/

static int stm32_foc_fault_clear(struct foc_dev_s *dev)
{
  struct stm32_foc_board_s *board = STM32_FOCBOARD_FROM_DEV_GET(dev);

  DEBUGASSERT(dev);
  DEBUGASSERT(board);

  return board->ops->fault_clear(dev);
}

#ifdef CONFIG_MOTOR_FOC_TRACE

/****************************************************************************
 * Name: stm32_foc_trace
 *
 * Description:
 *   Arch-specific trace initialization
 *
 ****************************************************************************/

int stm32_foc_trace_init(struct foc_dev_s *dev)
{
  struct stm32_foc_board_s *board = STM32_FOCBOARD_FROM_DEV_GET(dev);

  DEBUGASSERT(dev);
  DEBUGASSERT(board);

  /* Call board-specific logic */

  return board->ops->trace_init(dev);
}

/****************************************************************************
 * Name: stm32_foc_trace
 *
 * Description:
 *   Arch-specific trace
 *
 ****************************************************************************/

void stm32_foc_trace(struct foc_dev_s *dev, int type, bool state)
{
  struct stm32_foc_board_s *board = STM32_FOCBOARD_FROM_DEV_GET(dev);

  DEBUGASSERT(dev);
  DEBUGASSERT(board);

  /* Call board-specific logic */

  board->ops->trace(dev, type, state);
}
#endif

/****************************************************************************
 * Name: stm32_foc_adc_init
 *
 * Description:
 *   Initialize ADC instance
 *
 ****************************************************************************/

struct adc_dev_s *stm32_foc_adc_init(struct stm32_foc_adc_s *adc_cfg)
{
  struct adc_dev_s          *adc_dev   = NULL;
  int                        i         = 0;
#ifdef CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND
  uint8_t                   *adc_chan  = NULL;
  uint8_t                    adc_nchan = 0;
#endif

  DEBUGASSERT(adc_cfg);
  DEBUGASSERT(adc_cfg != NULL);
  DEBUGASSERT(adc_cfg->pins != NULL);
  DEBUGASSERT(adc_cfg->chan != NULL);

  /* Configure pins as analog inputs for the selected channels */

  for (i = 0; i < adc_cfg->nchan; i++)
    {
      stm32_configgpio(adc_cfg->pins[i]);
    }

  /* STM32G4 ADC channel 0 unwanted conversion workaround */

#ifdef CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND
  /* Add one dummy channel to conversion */

  adc_nchan = (adc_cfg->nchan + 1);

  /* Allocate memory for the extended list of channels */

  adc_chan = zalloc(adc_nchan);
  if (adc_chan == NULL)
    {
      goto errout;
    }

  /* Copy regular channels first */

  for (i = 0; i < adc_cfg->regch; i += 1)
    {
      adc_chan[i] = adc_cfg->chan[i];
    }

  /* Add dummy channel at the beginning of injected channels */

  adc_chan[adc_cfg->regch] = 0;

  /* Copy injected channels */

  for (i = (adc_cfg->regch + 1); i < adc_nchan; i += 1)
    {
      adc_chan[i] = adc_cfg->chan[i - 1];
    }
#endif /* CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND */

  /* Get the ADC interface */

#ifdef CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND
  adc_dev = stm32_adcinitialize(adc_cfg->intf,
                                adc_chan,
                                adc_nchan);

  free(adc_chan);
#else
  adc_dev = stm32_adcinitialize(adc_cfg->intf,
                                adc_cfg->chan,
                                adc_cfg->nchan);
#endif

  return adc_dev;

#ifdef CONFIG_STM32_FOC_G4_ADCCHAN0_WORKAROUND
errout:
  return NULL;
#endif
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_foc_initialize
 *
 * Description:
 *   Initialize the FOC lower-half.
 *
 * Input Parameters:
 *   inst  - FOC instance number
 *   board - FOC board-specific data
 *
 * Returned Value:
 *   Valid lower-half FOC controller structure reference on success;
 *   NULL on failure
 *
 ****************************************************************************/

struct foc_dev_s *
stm32_foc_initialize(int inst, struct stm32_foc_board_s *board)
{
  struct foc_dev_s          *dev       = NULL;
  struct stm32_foc_adc_s    *adc_cfg   = NULL;
  struct foc_lower_s        *foc_lower = NULL;
  struct stm32_foc_dev_s    *foc_dev   = NULL;
  struct stm32_foc_priv_s   *foc_priv  = NULL;
#ifdef FOC_ADC_HAVE_CMN
  struct stm32_foc_adccmn_s *adc_cmn   = NULL;
#endif
  uint32_t                   adc_irq   = 0;
  uint32_t                   pwm_base  = 0;
  uint32_t                   jextval   = 0;
  uint8_t                    pwm_inst  = 0;
  uint8_t                    adc_inst  = 0;
  uint32_t                   pwmfzbit  = 0;

